rgregg/esp32-gps/src/Nomaduino_GPS.cpp
/*
  Nomaduino GPS Receiver
  Copyright (c) 2025 Ryan Gregg
*/

#include <Arduino.h>
#include <WiFi.h>
#include <WiFiUdp.h>
#include "Display.h"
#include <Wire.h>

#ifdef USE_ST7789_DISPLAY
#include "displays/ST7789Display.h"
#endif
#ifdef USE_SH1107_DISPLAY
#include "displays/SH1107Display.h"
#endif

#include <SPI.h>
#include <TLogPlus.h>
#include <TelnetSerialStream.h>
#include <LittleFS.h>
#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <ArduinoJson.h>
#include <esp_ota_ops.h>
#include <ESP32-targz.h>
#include <DNSServer.h>
#include <unordered_map>

#include "Constants.h"
#include "GPSManager.h"
#include "AppSettings.h"
#include "ScreenManager.h"
#include "UDPManager.h"
#include "ButtonManager.h"
#include "BufferedLogStream.h"
#include "WebServerManager.h"
#include "renderer/ScreenRenderer.h"
#include "renderer/MonoScreenRenderer.h"
#include "MagnetometerManager.h"

using DebugCmd = std::function<void(String)>;

std::unordered_map<std::string, DebugCmd> debugCommands;
HardwareSerial GPSSerial(1);
GPSManager *gpsManager = nullptr;
ScreenManager *screenManager = nullptr;
AppSettings *settings = nullptr;
UDPManager *udpManager = nullptr;
ButtonManager *btnRight = nullptr;
ButtonManager *btnLeft = nullptr;
std::shared_ptr<BufferedLogStream> bufferedLogs;
WebServerManager* webServerManager = nullptr;
MagnetometerManager* magnetometerManager = nullptr;
DNSServer* dnsServer;
String fullHostname;

TLogPlusStream::TelnetSerialStream telnetSerialStream = TLogPlusStream::TelnetSerialStream();
uint32_t screenRefreshTimer = millis();
uint32_t lastWiFiConnectionTimer = 0;
uint32_t wifiFailureStartTime = 0;  // Track when WiFi failures started
uint32_t lastPortalScanTimer = 0;   // Track when we last scanned for configured network in portal mode
uint8_t overTheAirUpdateProgress = 0;
RTC_DATA_ATTR int bootCount = 0;
int runtimeDurationMillis = millis();

bool launchedConfigPortal = false;
bool portalLaunchedManually = false;  // Track if portal was launched manually vs automatically
bool isWiFiConfigured = true;
bool hasTriedWiFiConnection = false;  // Track if we've attempted WiFi connection
bool networkServicesInitalized = false;
bool isTelnetSetup = false;
uint8_t loopCounter = 0;

bool connectToWiFi(bool firstAttempt = false);
bool shouldAttemptWiFiConnection();
void completeConfigurationPortal();
void configureNetworkDependents(bool connected);
void initDebugCommands();
void onButtonLeftPress(ButtonPressType type);
void onButtonRightPress(ButtonPressType type);
void processDebugCommand(String debugCmd);
void processSerialInput();
void setupTelnetStream();
void startConfigPortal();
void WiFi_Connected(WiFiEvent_t wifi_event, WiFiEventInfo_t wifi_info);
void WiFi_Disconnected(WiFiEvent_t wifi_event, WiFiEventInfo_t wifi_info);
void WiFi_GotIPAddress(WiFiEvent_t wifi_event, WiFiEventInfo_t wifi_info);
void ScanI2CBus();

void setup()
{
  bootCount++;
  // Arduino IDE USB_CDC_ON_BOOT = Enable, default Serial input & output data from USB-C
  Serial.begin(115200);
  Serial.println("Booting Nomaduino GPS firmware");

  if (bootCount > 5) 
  {
    // Looks like we're stuck in a boot loop
    Serial.println("Detected boot loop, triggering rollback...");
    esp_err_t result = esp_ota_mark_app_invalid_rollback_and_reboot();
    if (result == ESP_FAIL) {
      Serial.println("rollback was not attempted");
    } else if (result == ESP_ERR_OTA_ROLLBACK_FAILED) {
      Serial.println("rollback failed");
    }
  }

  bufferedLogs = std::make_shared<BufferedLogStream>(50);
  
  TLogPlus::Log.begin();
  TLogPlus::Log.addPrintStream(bufferedLogs);
  TLogPlus::Log.printf("Firmware version: %s\r\n", AUTO_VERSION);

  initDebugCommands();

  TLogPlus::Log.debugln("Loading app settings");
  settings = new AppSettings();
  if (!settings->load())
  {
    TLogPlus::Log.infoln("Error loading settings - using defaults");
    settings->loadDefaults();
  }
  
  TLogPlus::Log.debugln("Loading file system");
  if (!LittleFS.begin(true))
  {
    TLogPlus::Log.warningln("An Error has occurred while mounting LittleFS. Device will restart.");
    delay(30000);
    ESP.restart();
  }

  // Initalize I2C
  bool result = Wire.begin(I2C_SDA, I2C_SCL);
  if (!result) {
    TLogPlus::Log.println("I2C: Error initalizing the I2C bus");
  }
  Wire.setClock(I2C_FREQ);


  // Initialize screen manager
  if(settings->getBool(USE_DISPLAY, false))
  {
    TLogPlus::Log.debugln("Loading screen manager");
    Display* display;
    ScreenRenderer* renderer;
  #ifdef USE_SH1107_DISPLAY
    display = new SH1107Display();
    renderer = new MonoScreenRenderer(display, &LittleFS);
  #else
    display = new ST7789Display();
    renderer = new ScreenRenderer(display, &LittleFS);
  #endif
    screenManager = new ScreenManager(settings, display, renderer);
    screenManager->begin();

    if (magnetometerManager) {
      screenManager->setMagnetometerManager(magnetometerManager);
    }
  } else {
    TLogPlus::Log.println("Display output is disabled.");
  }
  
  TLogPlus::Log.debugln("Connecting to WiFi");
  bool hasWiFiConfigured = connectToWiFi(true);

  // Initialize WiFi failure tracking
  if (hasWiFiConfigured) {
    wifiFailureStartTime = millis();  // Start tracking from setup if we have WiFi configured
  }

  TLogPlus::Log.debugln("Connecting to GPS device");
  gpsManager = new GPSManager(&GPSSerial, GPS_RX_PIN, GPS_TX_PIN, settings);
  gpsManager->begin();

  if (screenManager) screenManager->setGPSManager(gpsManager);
  
  if (settings->getBool(SETTING_UDP_ENABLED))
  {
    TLogPlus::Log.debugln("Setting up UDP manager");
    String host = settings->get(SETTING_UDP_HOST);
    uint16_t port = settings->getInt(SETTING_UDP_PORT);
    TLogPlus::Log.printf("Enabling UDP GPS sentence delivery to %s:%u", host, port);

    udpManager = new UDPManager(host.c_str(), port);
    gpsManager->setUDPManager(udpManager);  // TODO: refactor for observer pattern
  }

  if (settings->getBool(USE_MAGNETOMETER, false))
  {
    TLogPlus::Log.debugln("Setting up magnetometer");
    magnetometerManager = new MagnetometerManager(settings);
    if (!magnetometerManager->begin())
    {
      TLogPlus::Log.warningln("Could not find a valid magnetometer.");
    }
  }

  // Setup button managers
  btnRight = new ButtonManager(BTN_RIGHT_PIN, onButtonRightPress);
  btnLeft = new ButtonManager(BTN_LEFT_PIN, onButtonLeftPress);

