rgregg/esp32-gps/src/Nomaduino_GPS.cpp
void completeConfigurationPortal()
{
  if (!launchedConfigPortal) {
    return;
  }
  launchedConfigPortal = false;
  portalLaunchedManually = false;  // Reset manual launch flag

  TLogPlus::Log.debugln("Shutting down config portal");
  // wifiManager.stopConfigPortal();

  // Clean up the DNS server
  dnsServer->stop();
  delete dnsServer;
  dnsServer = nullptr;

  TLogPlus::Log.debugln("Connecting to wifi");
  wifiFailureStartTime = 0;  // Reset failure timer when exiting portal
  connectToWiFi();
}

void setupTelnetStream()
{
  if (!ENABLE_TELNET)
  {
    TLogPlus::Log.debugln("Telnet logging is disabled.");
    return;
  }
  
  TLogPlus::Log.debugln("Initializing telnet server.");

  telnetSerialStream.setLineMode();
  telnetSerialStream.setLogActions();

  telnetSerialStream.onInputReceived([](String str)
                                     {
                                       processDebugCommand(str); 
                                     });

  telnetSerialStream.onConnect([](IPAddress ipAddress)
                               {
                                 TLogPlus::Log.info("onConnection: Connection from ");
                                 TLogPlus::Log.infoln(ipAddress.toString());
                               });

  telnetSerialStream.onDisconnect([](IPAddress ipAddress)
                                  {
                                    TLogPlus::Log.info("onDisconnect: Disconnection from ");
                                    TLogPlus::Log.infoln(ipAddress.toString());
                                  });
  telnetSerialStream.begin();
  // add telnetSerialStream to log
  TLogPlus::Log.addPrintStream(std::make_shared<TLogPlusStream::TelnetSerialStream>(telnetSerialStream));
  isTelnetSetup = true;
}

void processDebugCommand(String debugCmd)
{
  TLogPlus::Log.debug("Received debug command: ");
  TLogPlus::Log.debugln(debugCmd);

  // Receives a debug command from serial or telnet connection and performs the desired action
  int sepIndex = debugCmd.indexOf(':');
  String cmd;
  String value = "";
  if (sepIndex == -1)
  {
    cmd = debugCmd;
  }
  else
  {
    cmd = debugCmd.substring(0, sepIndex);
    value = debugCmd.substring(sepIndex + 1);
  }

  cmd.toLowerCase();
  if(debugCommands.find(cmd.c_str()) != debugCommands.end())
  {
    debugCommands[cmd.c_str()](value);
  } else {
    TLogPlus::Log.printf("Unrecognized debug command: %s\n", cmd);
  }
}

bool connectToWiFi(bool firstAttempt)
{
  String ssid = settings->get(SETTING_WIFI_SSID);
  String password = settings->get(SETTING_WIFI_PSK);

  if (ssid.isEmpty())
  {
    TLogPlus::Log.warningln("No WiFi SSID configured.");
    isWiFiConfigured = false;
    return false;
  }

  isWiFiConfigured = true;
  
  if (!isWiFiConfigured)
  {
    return false;
  }

  TLogPlus::Log.debugln("Connecting to WiFi");
  lastWiFiConnectionTimer = millis();

  // Configure the hostname
  if (firstAttempt)
  {
    String nameprefix = settings->get(SETTING_WIFI_HOSTNAME, WIFI_HOSTNAME_DEFAULT);
    uint8_t mac[6];
    WiFi.macAddress(mac);
    char mac_cstr[7];
    snprintf(mac_cstr, sizeof(mac_cstr), "%02x%02x%02x", mac[3], mac[4], mac[5]);
    fullHostname = nameprefix + "-" + mac_cstr;
    WiFi.setHostname(fullHostname.c_str());
    TLogPlus::Log.debug("Device hostname: ");
    TLogPlus::Log.debugln(fullHostname);

    WiFi.onEvent(WiFi_Connected, ARDUINO_EVENT_WIFI_STA_CONNECTED);
    WiFi.onEvent(WiFi_GotIPAddress, ARDUINO_EVENT_WIFI_STA_GOT_IP);
    WiFi.onEvent(WiFi_Disconnected, ARDUINO_EVENT_WIFI_STA_DISCONNECTED);
    WiFi.setAutoReconnect(false);
  }

  uint32_t freeSpace = ESP.getFreeHeap();
  WiFi.mode(WIFI_STA);

  TLogPlus::Log.info("Attempting to connect to WiFi network: ");
  TLogPlus::Log.infoln(ssid);
  WiFi.begin(ssid.c_str(), password.c_str());
  return true;
}

bool shouldAttemptWiFiConnection()
{
  if (WiFi.status() != WL_DISCONNECTED)
    return false;
  if (screenManager && screenManager->getScreenMode() == SCREEN_NEEDS_CONFIG)
    return false;

  return ((millis() - lastWiFiConnectionTimer) > WIFI_RECONNECT_TIMEOUT);
}

void WiFi_Connected(WiFiEvent_t wifi_event, WiFiEventInfo_t wifi_info)
{
  TLogPlus::Log.debugln("Connected to WiFi");
  wifiFailureStartTime = 0;  // Reset failure timer when connected
}

void WiFi_GotIPAddress(WiFiEvent_t wifi_event, WiFiEventInfo_t wifi_info)
{
  TLogPlus::Log.println("Got IP: " + WiFi.localIP().toString());
  configureNetworkDependents(true);
}

void configureNetworkDependents(bool connected)
{
  if (connected && !networkServicesInitalized)
  {
    networkServicesInitalized = true;
    // We're on the network with an IP address!
    setupTelnetStream();
    if (!webServerManager) {
      webServerManager = new WebServerManager(settings, gpsManager, screenManager);
      webServerManager->setWiFiConnectCallback([](){ connectToWiFi(); });
      webServerManager->begin();
    }
    if (udpManager != nullptr)
      udpManager->begin();
    TLogPlus::Log.println("Network services enabled");
  }
  else if (!connected && networkServicesInitalized)
  {
    // We don't have an IP address or network connection
    networkServicesInitalized = false;
    isTelnetSetup = false;
    telnetSerialStream.stop();
    if (webServerManager) {
      webServerManager->end();
      delete webServerManager;
      webServerManager = nullptr;
    }
    if (udpManager != nullptr)
      udpManager->stop();
    TLogPlus::Log.println("Network services disabled");
  }
}

void WiFi_Disconnected(WiFiEvent_t wifi_event, WiFiEventInfo_t wifi_info)
{
  TLogPlus::Log.printf("WiFi disconnected; event: %u, reason: %u\n", 
    wifi_event,
    wifi_info.wifi_sta_disconnected.reason);

  configureNetworkDependents(false);
}

String serialBuffer = "";

void processSerialInput()
{
  while (Serial.available() > 0)
  {
    char c = Serial.read();

    // Echo the character back
    Serial.write(c);

    // Newline or carriage return means the user pressed Enter
    if (c == '\n' || c == '\r')
    {
      serialBuffer.trim();  // remove leading/trailing whitespace
      if (serialBuffer.length() > 0)
      {
        processDebugCommand(serialBuffer);
      }
      serialBuffer = "";  // reset for next command
    }
    else
    {
      serialBuffer += c;  // build up the string
    }
  }
}

void initDebugCommands()
{
  debugCommands["sendgpscmd"] = [](String value) { gpsManager->sendCommand(value.c_str()); };
  debugCommands["setgpsbaud"] = [](String value) { gpsManager->changeBaud(value.toInt()); };
  debugCommands["setgpsdata"] = [](String value) { gpsManager->setDataMode((GPSDataMode)value.toInt()); };
  debugCommands["setgpsfix"] = [](String value) { gpsManager->setFixRate((GPSRate)value.toInt()); };
  debugCommands["setgpsrate"] = [](String value) { gpsManager->setRefreshRate((GPSRate)value.toInt()); };
  debugCommands["getgps"] = [](String value) { gpsManager->printToLog(); };
  debugCommands["getheading"] = [](String value) { 
    if (magnetometerManager) {
      TLogPlus::Log.printf("Heading: %f\n", magnetometerManager->getHeading());
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };
  debugCommands["getmotion"] = [](String value) {
    if (magnetometerManager) {
      TLogPlus::Log.printf("Motion: %s\n", magnetometerManager->isMoving() ? "moving" : "stopped");
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };
  debugCommands["setmagcalmode"] = [](String value) {
    if (magnetometerManager) {
      bool enabled = value.toInt() == 1;
      magnetometerManager->setCalibrationModeEnabled(enabled);
      TLogPlus::Log.printf("Magnetometer calibration mode set to: %s\n", enabled ? "enabled" : "disabled");
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };
  debugCommands["startmagcal"] = [](String value) {
    if (magnetometerManager) {
      magnetometerManager->startCalibration();
      TLogPlus::Log.infoln("Magnetometer calibration started. Move device in a full circle.");
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };
  debugCommands["stopmagcal"] = [](String value) {
    if (magnetometerManager) {
      magnetometerManager->stopCalibration();
      TLogPlus::Log.infoln("Magnetometer calibration stopped. Offsets calculated and saved.");
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };
  debugCommands["getmagcaloffsets"] = [](String value) {
    if (magnetometerManager) {
      float x, y, z;
      magnetometerManager->getCalibrationOffsets(x, y, z);
      TLogPlus::Log.printf("Magnetometer calibration offsets: X=%f, Y=%f, Z=%f\n", x, y, z);
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };
  debugCommands["setmagcaloffsets"] = [](String value) {
    if (magnetometerManager) {
      // Parse comma-separated values: X,Y,Z
      int firstComma = value.indexOf(',');
      int secondComma = value.indexOf(',', firstComma + 1);
      if (firstComma != -1 && secondComma != -1) {
        float x = value.substring(0, firstComma).toFloat();
        float y = value.substring(firstComma + 1, secondComma).toFloat();
        float z = value.substring(secondComma + 1).toFloat();
        magnetometerManager->setCalibrationOffsets(x, y, z);
        TLogPlus::Log.printf("Magnetometer calibration offsets set to: X=%f, Y=%f, Z=%f\n", x, y, z);
      } else {
        TLogPlus::Log.warningln("Invalid format for setmagcaloffsets. Use X,Y,Z");
      }
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };

  debugCommands["refresh"] = [](String value) { if (screenManager) screenManager->refreshScreen(); };
  debugCommands["backlight"] = [](String value) { if (screenManager) screenManager->setBacklight((uint8_t)value.toInt()); };
  debugCommands["setscreenmode"] = [](String value) { if (screenManager) screenManager->setScreenMode((ScreenMode)value.toInt()); };

  debugCommands["setwifi"] = [](String value) { settings->set(SETTING_WIFI_SSID, value); };
  debugCommands["setpassword"] = [](String value) { settings->set(SETTING_WIFI_PSK, value); };
  debugCommands["getwifi"] = [](String value) { 
    TLogPlus::Log.infoln("Printing WiFi information");
    TLogPlus::Log.printf("Status: %u\n", WiFi.status());
    TLogPlus::Log.println("IP: " + WiFi.localIP().toString());
    TLogPlus::Log.printf("Base Station ID: %s\n", WiFi.BSSIDstr().c_str());
    TLogPlus::Log.printf("SSID: %s\n", WiFi.SSID().c_str());
    TLogPlus::Log.printf("RSSI: %i\n", WiFi.RSSI()); 
  };
  debugCommands["reconnect"] = [](String value) { connectToWiFi(); };

  debugCommands["setsettings"] = [](String value) { settings->load(value); };
  debugCommands["getsettings"] = [](String value) { settings->printToLog(); };
  debugCommands["reboot"] = [](String value) { ESP.restart(); };

