rgregg/esp32-gps/src/Nomaduino_GPS.cpp
  debugCommands["setudphost"] = [](String value) { 
    udpManager->setDestHost(value.c_str());
    settings->set(SETTING_UDP_HOST, value); 
  };
  debugCommands["setudpport"] = [](String value) { 
    udpManager->setDestPort(value.toInt());
    settings->setInt(SETTING_UDP_PORT, value.toInt());
  };

  debugCommands["help"] = [](String value) {
    TLogPlus::Log.println("Valid debug commands are:");
    for (const auto& pair : debugCommands) {
      TLogPlus::Log.println(pair.first.c_str());
    }
  };
  debugCommands["getlog"] = [](String value) {
    bufferedLogs->printAll(Serial);
    if (isTelnetSetup) {
      bufferedLogs->printAll(telnetSerialStream);
    }
    TLogPlus::Log.println("End of log");
  };
  debugCommands["getgpsdata"] = [](String value) {
    if (gpsManager) {
      gpsManager->receivedSentences(Serial);
      if (isTelnetSetup) {
        gpsManager->receivedSentences(telnetSerialStream);
      }
    }
    TLogPlus::Log.println("End of data");
  };
  debugCommands["scani2c"] = [](String value) {
    ScanI2CBus();
  };
}


void ScanI2CBus() {
  TLogPlus::Log.println("I2C device scan...");

  byte error, address;
  int devices = 0;

  for (address = 0x01; address < 0x7F; address++) {
    Wire.beginTransmission(address);
    error = Wire.endTransmission();

    if (error == 0) {
      TLogPlus::Log.printf("I2C device found at address 0x%02X\n", address);
      devices++;
    } else if (error == 4) {
      TLogPlus::Log.printf("Unknown error at address 0x%02X\n", address);
    }
    TLogPlus::Log.print('.');
  }

  if (devices == 0)
    TLogPlus::Log.println("No I2C devices found\n");
  else
    TLogPlus::Log.println("Scan complete\n");
}